cw2/cw2.org
#+title: Laboratorium 2 - Teoria współbieżności
#+date: 21.10.2024r.
#+author: Piotr Karamon
#+setupfile: ../setupfile.org


* Treści zadań
** Zadanie 1
Zaimplementować semafor binarny za pomocą metod wait i notify, użyć go do
synchronizacji programu Wyścig.

** Zadanie 2
Pokazać, ze do implementacji semafora za pomocą metod wait i =notify= nie
wystarczy instrukcja =if= tylko potrzeba użyć =while=. Wyjaśnić teoretycznie
dlaczego i potwierdzić eksperymentem w praktyce.(wskazówka: rozważyć dwie
kolejki: czekająca na wejście do monitora obiektu oraz kolejkę związana z
instrukcją =wait=, rozważyć kto kiedy jest budzony i kiedy następuje wyścig).

** Zadanie 3
Zaimplementować semafor licznikowy (ogólny) za pomocą semaforów binarnych. Czy
semafor binarny jest szczególnym przypadkiem semafora ogólnego?

