cw02/cw2.tex
\section*{Zadanie 1}
\label{sec:orgecd68bf}

Implementujemy dwie metody semafora binarnego:

\begin{itemize}
\item \texttt{P()}: próbuje uzyskać dostęp do zasobu. Jeśli
zasób jest zajęty (\texttt{isAvailable} jest \texttt{false}), wątek zwiększa licznik \texttt{waiting} i
czeka (\texttt{wait()}). Gdy zasób staje się dostępny, wątek zmniejsza licznik \texttt{waiting}
i ustawia \texttt{isAvailable} na \texttt{false}.
\item \texttt{V()}: zwalnia zasób. Ustawia \texttt{isAvailable} na \texttt{true}
i powiadamia (\texttt{notify()}) jeden z oczekujących wątków, jeśli taki istnieje
(\texttt{waiting > 0}).
\end{itemize}

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{BinarySemaphore} \EFrda{\{}
    \EFk{private} \EFt{boolean} \EFv{isAvailable} = \EFo{true};
    \EFk{private} \EFt{int} \EFv{waiting} = \EFhn{0};

    \EFk{public} BinarySemaphore\EFrdb{(}\EFrdb{)} \EFrdb{\{}\EFrdb{\}}

    \EFk{public} \EFk{synchronized} \EFt{void} \EFf{P}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{while} \EFrdc{(}\EFnc{!}isAvailable\EFrdc{)} \EFrdc{\{}
            waiting++;
            \EFk{try} \EFrdd{\{}
                wait\EFrda{(}\EFrda{)};
            \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
                e.printStackTrace\EFrda{(}\EFrda{)};
            \EFrdd{\}}
            waiting--;
        \EFrdc{\}}
        isAvailable = \EFo{false};

    \EFrdb{\}}

    \EFk{public} \EFk{synchronized} \EFt{void} \EFf{V}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        isAvailable = \EFo{true};
        \EFk{if} \EFrdc{(}waiting > \EFhn{0}\EFrdc{)} \EFrdc{\{}
            notify\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Aby zsynchronizować program Wyścig, do klasy każdego wątku podajemy semafora przez
konstruktor, następnie w metodzie \texttt{run()} oba wątki, używają semafora w celu
synchronizacji.

Klasa \texttt{IThread}:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{IThread} \EFk{extends} \EFt{Thread} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{Counter} \EFv{\_cnt};
    \EFk{private} \EFk{final} \EFt{BinarySemaphore} \EFv{\_sem};

    \EFk{public} IThread\EFrdb{(}\EFt{Counter} \EFv{c}, BinarySemaphore s\EFrdb{)} \EFrdb{\{}
        \_cnt = c;
        \_sem = s;
    \EFrdb{\}}
    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFhn{100000000}; ++i\EFrdc{)} \EFrdc{\{}
            \EFo{\_sem}.P\EFrdd{(}\EFrdd{)};
            \_cnt.inc\EFrdd{(}\EFrdd{)};
            \EFo{\_sem}.V\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}


Klasa \texttt{DThread}:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{DThread} \EFk{extends} \EFt{Thread} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{Counter} \EFv{\_cnt};
    \EFk{private} \EFk{final} \EFt{BinarySemaphore} \EFv{\_sem};

    \EFk{public} DThread\EFrdb{(}\EFt{Counter} \EFv{c}, BinarySemaphore s\EFrdb{)} \EFrdb{\{}
        \_cnt = c;
        \_sem = s;
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{int} \EFv{i} = \EFhn{0}; i < \EFhn{100000000}; ++i\EFrdc{)} \EFrdc{\{}
            \EFo{\_sem}.P\EFrdd{(}\EFrdd{)};
            \_cnt.dec\EFrdd{(}\EFrdd{)};
            \EFo{\_sem}.V\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

W metodzie \texttt{main} podajemy semafora do wątków,
uruchamiamy je, czekamy aż się zakończą i sprawdzamy finalny wynik.
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{static} \EFt{void} \EFf{main}\EFrda{(}\EFt{String}\EFrdb{[}\EFrdb{]} \EFv{args}\EFrda{)} \EFrda{\{}
\EFt{Counter} \EFv{cnt} = \EFk{new} \EFt{Counter}\EFrdb{(}\EFhn{0}\EFrdb{)};

\EFt{BinarySemaphore} \EFv{sem} = \EFk{new} \EFt{BinarySemaphore}\EFrdb{(}\EFrdb{)};

\EFt{IThread} \EFv{it} = \EFk{new} \EFt{IThread}\EFrdb{(}cnt, sem\EFrdb{)};
\EFt{DThread} \EFv{dt} = \EFk{new} \EFt{DThread}\EFrdb{(}cnt, sem\EFrdb{)};

it.start\EFrdb{(}\EFrdb{)};
dt.start\EFrdb{(}\EFrdb{)};

\EFk{try} \EFrdb{\{}
        it.join\EFrdc{(}\EFrdc{)};
        dt.join\EFrdc{(}\EFrdc{)};
\EFrdb{\}} \EFk{catch}\EFrdb{(}InterruptedException ie\EFrdb{)} \EFrdb{\{} \EFrdb{\}}

System.out.println\EFrdb{(}\EFs{"value="} + cnt.value\EFrdc{(}\EFrdc{)}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}

Wynik działania programu:
\begin{tcolorbox}
\begin{Verbatim}
value=0
\end{Verbatim}



\end{tcolorbox}\textbf{Wnioski}: Stworzony przez nas semafor binarny może być użyty w celu synchronizacji
działania wielu wątków, w celu wyeliminowania wyścigu.
\section*{Zadanie 2}
\label{sec:org512295d}
Aby pokazać, że użycie instrukcji \texttt{if} nie wystarczy do implementacji semafora
zademonstrujemy przykład pokazujący wyścig w takiej sytuacji.

Mamy trzy wątki:
\begin{center}
\begin{tabular}{ll}
nazwa & stan\\
\hline
\(a\) & jest uśpiony w \texttt{P()} (wait set)\\
\(b\) & będzie chciał wywołać \texttt{P()}\\
\(c\) & obecnie wywołuje metodę \texttt{V()} (posiada monitor)\\
\end{tabular}
\end{center}

Rozważmy następujący przeplot:
\begin{enumerate}
\item \(b\) chce wywołać metodę \texttt{P()}, ale obecnie \(c\) posiada monitor, wątek \(b\) trafia więc
do kolejki monitora(entry set).
\item \(c\) w metodzie \texttt{V()} wywołuje \texttt{notify}, co sprawia, że jedyny wątek w wait set
czyli wątek \(a\) jest oznaczony do wykonania. Wątek kończy metodę i zwalnia monitor.
\item \(b\) jest w entry set, \(a\) w wait set. Zająć monitor może którykolwiek z nich.
\(b\) zajmuje monitor, wywołuje metodę \texttt{P()}, ustawiając \texttt{isAvailable=false} i
ostatecznie zwalnia monitor.
\item Przez oznaczenie wątku \(a\) w kroku 2. wątek zajmuje monitor, ale przez
brak pętli \texttt{while}, wątek ten ustawia \texttt{isAvailable=false} i zaczyna wykonywać swoją sekcję krytyczną.
\end{enumerate}

Jak widać mamy tutaj do czynienia z sytuacją absolutnie niedopuszczalną, bo
wątki \(b\) i \(a\) myślą, że mają ekskluzywny dostęp do danego zasobu.  Gdybyśmy
zastąpili \texttt{if} pętlą \texttt{while} wątek \(a\) po wybudzeniu, ponownie sprawdziłby warunek i
znów trafił do wait set.

Aby pokazać, że wymagana jest w implementacji pętla \texttt{while}, w metodzie \texttt{P()}
zamieniamy instrukcję \texttt{while} na \texttt{if}.
Następnie w metodzie \texttt{main} tworzymy cztery wątki w celu zwiększenia szans wyścigu:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{static} \EFt{void} \EFf{main}\EFrda{(}\EFt{String}\EFrdb{[}\EFrdb{]} \EFv{args}\EFrda{)} \EFrda{\{}
    \EFt{Counter} \EFv{cnt} = \EFk{new} \EFt{Counter}\EFrdb{(}\EFhn{0}\EFrdb{)};

    \EFt{BinarySemaphore} \EFv{sem} = \EFk{new} \EFt{BinarySemaphore}\EFrdb{(}\EFrdb{)};

    \EFt{List}\EFrdb{<}\EFt{Thread}\EFrdb{>} \EFv{threads} = List.of\EFrdb{(}
        \EFk{new} \EFt{IThread}\EFrdc{(}cnt, sem\EFrdc{)},
        \EFk{new} \EFt{DThread}\EFrdc{(}cnt, sem\EFrdc{)},
        \EFk{new} \EFt{IThread}\EFrdc{(}cnt, sem\EFrdc{)},
        \EFk{new} \EFt{DThread}\EFrdc{(}cnt, sem\EFrdc{)}
    \EFrdb{)};


    threads.forEach\EFrdb{(}Thread::start\EFrdb{)};

    \EFk{try} \EFrdb{\{}
        \EFk{for} \EFrdc{(}\EFt{Thread} \EFv{t} : threads\EFrdc{)} \EFrdc{\{}
            t.join\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}} \EFk{catch}\EFrdb{(}InterruptedException ie\EFrdb{)} \EFrdb{\{} \EFrdb{\}}

    System.out.println\EFrdb{(}\EFs{"value="} + cnt.value\EFrdc{(}\EFrdc{)}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}

Wynik programu:
\begin{tcolorbox}
\begin{Verbatim}
value=-689
\end{Verbatim}


\end{tcolorbox}Jak widzimy wynik odbiega od poprawnego zera.

\textbf{Wnioski}: Przy implementacji niskopoziomowych narzędzi synchronizacji musi być
bardzo uważni. Wymóg zastosowania pętli \texttt{while} na pierwszy rzut oka wcale nie musi być
oczywisty. Jego konieczność wynika z zasady działania monitora w języku Java.
Implementując zatem takie narzędzia musimy być niezwykle pewni tego na
jakich innych narzędziach je bazujemy.
