cw2/cw2.org
* Zadanie 3
Aby zaimplementować semafor licznikowy wykorzystamy zmienną =counter= oraz dwa semafory:
+ =mutex= - chroni zmienną =counter=
+ =gate= - ten semafor jest podniesiony gdy ~counter > 0~, czyli wtedy
        gdy chociaż jeden zasób jest nadal dostępny.

#+begin_src java :eval no
class CountingSemaphore {
    private final BinarySemaphore gate;
    private final BinarySemaphore mutex;
    private int counter;

    public CountingSemaphore(int n) {
        mutex = new BinarySemaphore();
        gate = new BinarySemaphore();
        counter = n;
        if (counter == 0) {
            gate.P();
        }
    }

    public void P() {
        gate.P();
        mutex.P();
        counter--;
        if (counter > 0) {
            gate.V();
        }
        mutex.V();
    }

    public void V() {
        mutex.P();
        counter++;
        if (counter >= 1) {
            gate.V();
        }
        mutex.V();
    }
}
#+end_src

Aby zademonstrować działanie tej klasy zasymulujemy jedno z częstych zastosowań
dla takiego semafora. Ograniczymy ilość otwartych gniazd przez nasz program, z
racji tego, że ta liczba w systemie ma najczęściej swoją górną granicę.
Przy naiwnym programie typu web-scraper, bez kontroli ilości otwartych gniazd
moglibyśmy przekroczyć ten limit co skutkowałoby wyjątkami, system odmówił by
utworzenia nowego gniazda.

Kod wątku który symuluje otwarcie gniazda:
#+begin_src java
class OpenNetworkSocketThread extends Thread {
    private final CountingSemaphore _sem;
    private final int id;

    public OpenNetworkSocketThread(int id, CountingSemaphore s) {
        this.id = id;
        _sem = s;
    }

    public void run() {
        _sem.P();
        System.out.println("Opened network socket in " + id);
        try {
            Thread.sleep(ThreadLocalRandom.current().nextInt(100, 300));
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
        System.out.println("Closing network socket in " + id);
        _sem.V();
    }
}
#+end_src

Metoda =main=.
#+begin_src java
public static void main(String[] args) {
    var sem = new CountingSemaphore(3);
    List<OpenNetworkSocketThread> threads =
        IntStream.range(0, 10)
            .mapToObj(i -> new OpenNetworkSocketThread(i, sem))
            .toList();

    theads.forEach(Thread::start);
    threads.forEach(t -> {
        try {
            t.join();
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
    });
}
#+end_src

Wynik programu:
#+begin_example
Opened network socket in 1
Opened network socket in 0
Opened network socket in 2
Closing network socket in 1
Opened network socket in 3
Closing network socket in 2
Opened network socket in 4
Closing network socket in 0
Opened network socket in 6
Closing network socket in 3
Opened network socket in 5
Closing network socket in 4
Opened network socket in 7
Closing network socket in 6
Opened network socket in 8
Closing network socket in 5
Opened network socket in 9
Closing network socket in 7
Closing network socket in 8
Closing network socket in 9
#+end_example

Jak widać stworzony przez nas semafor poprawnie umożliwia utworzenie jedynie trzech gniazd w
danym momencie.

Semafor binarny jest szczególnym przypadkiem semafora licznikowego. Semafor
licznikowy zachowuje się tak samo jak semafor binarny gdy liczba zasobów jest
równa jeden. Nie oznacza to jednak, że zawsze powinniśmy korzystać z semaforów
licznikowych skoro są ogólniejsze od semaforów binarnych. Semafor binarny
ma prostszą implementację(licznikowy składa się właśnie z dwóch takich semaforów),
przez to jeżeli potrzebujemy zwykłego mutex'a to powinniśmy właśnie użyć semafora binarnego.


* Bibliografia
+ Bill Venners: /Inside the Java Virtual Machine Chapter 20/
