cw02/cw2.tex
\section*{Zadanie 3}
\label{sec:org234408c}
Aby zaimplementować semafor licznikowy wykorzystamy zmienną \texttt{counter} oraz dwa semafory:
\begin{itemize}
\item \texttt{mutex} - chroni zmienną \texttt{counter}
\item \texttt{gate} - ten semafor jest podniesiony gdy \texttt{counter > 0}, czyli wtedy
gdy chociaż jeden zasób jest nadal dostępny.
\end{itemize}

\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{CountingSemaphore} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{BinarySemaphore} \EFv{gate};
    \EFk{private} \EFk{final} \EFt{BinarySemaphore} \EFv{mutex};
    \EFk{private} \EFt{int} \EFv{counter};

    \EFk{public} CountingSemaphore\EFrdb{(}\EFt{int} \EFv{n}\EFrdb{)} \EFrdb{\{}
        mutex = \EFk{new} \EFt{BinarySemaphore}\EFrdc{(}\EFrdc{)};
        gate = \EFk{new} \EFt{BinarySemaphore}\EFrdc{(}\EFrdc{)};
        counter = n;
        \EFk{if} \EFrdc{(}counter == \EFhn{0}\EFrdc{)} \EFrdc{\{}
            \EFo{gate}.P\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{P}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFo{gate}.P\EFrdc{(}\EFrdc{)};
        \EFo{mutex}.P\EFrdc{(}\EFrdc{)};
        counter--;
        \EFk{if} \EFrdc{(}counter > \EFhn{0}\EFrdc{)} \EFrdc{\{}
            \EFo{gate}.V\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
        \EFo{mutex}.V\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{V}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFo{mutex}.P\EFrdc{(}\EFrdc{)};
        counter++;
        \EFk{if} \EFrdc{(}counter >= \EFhn{1}\EFrdc{)} \EFrdc{\{}
            \EFo{gate}.V\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
        \EFo{mutex}.V\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Aby zademonstrować działanie tej klasy zasymulujemy jedno z częstych zastosowań
dla takiego semafora. Ograniczymy ilość otwartych gniazd przez nasz program, z
racji tego, że ta liczba w systemie ma najczęściej swoją górną granicę.
Przy naiwnym programie typu web-scraper, bez kontroli ilości otwartych gniazd
moglibyśmy przekroczyć ten limit co skutkowałoby wyjątkami, system odmówił by
utworzenia nowego gniazda.

Kod wątku który symuluje otwarcie gniazda:
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{class} \EFt{OpenNetworkSocketThread} \EFk{extends} \EFt{Thread} \EFrda{\{}
    \EFk{private} \EFk{final} \EFt{CountingSemaphore} \EFv{\_sem};
    \EFk{private} \EFk{final} \EFt{int} \EFv{id};

    \EFk{public} OpenNetworkSocketThread\EFrdb{(}\EFt{int} \EFv{id}, CountingSemaphore s\EFrdb{)} \EFrdb{\{}
        \EFk{this}.id = id;
        \_sem = s;
    \EFrdb{\}}

    \EFk{public} \EFt{void} \EFf{run}\EFrdb{(}\EFrdb{)} \EFrdb{\{}
        \EFo{\_sem}.P\EFrdc{(}\EFrdc{)};
        System.out.println\EFrdc{(}\EFs{"Opened network socket in "} + id\EFrdc{)};
        \EFk{try} \EFrdc{\{}
            Thread.sleep\EFrdd{(}ThreadLocalRandom.current\EFrda{(}\EFrda{)}.nextInt\EFrda{(}\EFhn{100}, \EFhn{300}\EFrda{)}\EFrdd{)};
        \EFrdc{\}} \EFk{catch} \EFrdc{(}InterruptedException e\EFrdc{)} \EFrdc{\{}
            e.printStackTrace\EFrdd{(}\EFrdd{)};
        \EFrdc{\}}
        System.out.println\EFrdc{(}\EFs{"Closing network socket in "} + id\EFrdc{)};
        \EFo{\_sem}.V\EFrdc{(}\EFrdc{)};
    \EFrdb{\}}
\EFrda{\}}
\end{Verbatim}
\end{Code}

Metoda \texttt{main}.
\begin{Code}
\begin{Verbatim}
\color{EFD}\EFk{public} \EFk{static} \EFt{void} \EFf{main}\EFrda{(}\EFt{String}\EFrdb{[}\EFrdb{]} \EFv{args}\EFrda{)} \EFrda{\{}
    \EFt{var} \EFv{sem} = \EFk{new} \EFt{CountingSemaphore}\EFrdb{(}\EFhn{3}\EFrdb{)};
    \EFt{List}\EFrdb{<}\EFt{OpenNetworkSocketThread}\EFrdb{>} \EFv{threads} =
        IntStream.range\EFrdb{(}\EFhn{0}, \EFhn{10}\EFrdb{)}
            .mapToObj\EFrdb{(}i -> \EFk{new} \EFt{OpenNetworkSocketThread}\EFrdc{(}i, sem\EFrdc{)}\EFrdb{)}
            .toList\EFrdb{(}\EFrdb{)};

    theads.forEach\EFrdb{(}Thread::start\EFrdb{)};
    threads.forEach\EFrdb{(}t -> \EFrdc{\{}
        \EFk{try} \EFrdd{\{}
            t.join\EFrda{(}\EFrda{)};
        \EFrdd{\}} \EFk{catch} \EFrdd{(}InterruptedException e\EFrdd{)} \EFrdd{\{}
            e.printStackTrace\EFrda{(}\EFrda{)};
        \EFrdd{\}}
    \EFrdc{\}}\EFrdb{)};
\EFrda{\}}
\end{Verbatim}
\end{Code}

Wynik programu:
\begin{tcolorbox}
\begin{Verbatim}
Opened network socket in 1
Opened network socket in 0
Opened network socket in 2
Closing network socket in 1
Opened network socket in 3
Closing network socket in 2
Opened network socket in 4
Closing network socket in 0
Opened network socket in 6
Closing network socket in 3
Opened network socket in 5
Closing network socket in 4
Opened network socket in 7
Closing network socket in 6
Opened network socket in 8
Closing network socket in 5
Opened network socket in 9
Closing network socket in 7
Closing network socket in 8
Closing network socket in 9
\end{Verbatim}


\end{tcolorbox}Jak widać stworzony przez nas semafor poprawnie umożliwia utworzenie jedynie trzech gniazd w
danym momencie.

Semafor binarny jest szczególnym przypadkiem semafora licznikowego. Semafor
licznikowy zachowuje się tak samo jak semafor binarny gdy liczba zasobów jest
równa jeden. Nie oznacza to jednak, że zawsze powinniśmy korzystać z semaforów
licznikowych skoro są ogólniejsze od semaforów binarnych. Semafor binarny
ma prostszą implementację(licznikowy składa się właśnie z dwóch takich semaforów),
przez to jeżeli potrzebujemy zwykłego mutex'a to powinniśmy właśnie użyć semafora binarnego.
\section*{Bibliografia}
\label{sec:org7dbccd1}
\begin{itemize}
\item Bill Venners: \emph{Inside the Java Virtual Machine Chapter 20}
\end{itemize}
\end{document}
